
# coding: utf-8

# # Numpy and Scipy

# Импорт

# In[1]:




# Создайте два целочисленных 3-мерных вектора и выведите их

# In[ ]:




# In[ ]:




# Найдите их скалярное произведение

# In[ ]:




# Создайте две целочисленных матрицы 3*3 и выведите их

# In[ ]:




# In[ ]:




# Выполните умножение матриц

# In[ ]:




# Найти обратную от полученного произведения

# In[ ]:




# Сделать проверку на правильность результата

# In[ ]:




# In[ ]:




# Выведите только верхнуюю матрицу 2*2 полученной обратной матрицу

# In[ ]:




# Превратите последний результат в 4-хмерный вектор двумя способами

# In[ ]:




# In[ ]:




# Посчитайте норму матрицы 2 * 2 и 4хмерного вектора. Одинаковые ли?

# In[ ]:




# Решите систему уравнений _mat_{1} * X = v_{1}

# In[ ]:




# # Pandas

# Импорт

# In[ ]:




# Загрузите в DataFrame файл HR.csv
# 
# P.S. Обратите внимание на индексы

# In[ ]:




# Выведите первые 5 строк

# In[ ]:




# Вывести последние 5 строк

# In[ ]:




# Получите описание ваших данных

# In[ ]:




# На основании описания таблицы создайте колонку hours_level на основе значений колонки average_montly_hours на строковые 3х категорий. Объясните в кратце свой выбор
# 
# P.S. Не зацикливайтесь

# In[ ]:




# Выведите данные о количестве проектов и уровня отработанных часов

# In[ ]:




# Если ли зависимость между уровнем отработанных часов и средним количесвом проектов? Ответ подкрепите соответствующей таблицей

# In[ ]:




# Сколько сотрудников принадлежит каждой группе и сколько суммарно проектов взяла каждая группа взяли?

# In[ ]:




# In[ ]:




# Получите и выведите статистику на счет того, сколько людей ушло в зависимости от количества проектов (1-й приоритет) и уровня отработанных часов (2й приоритет). Сохраните результат в "плоский" DataFrame

# In[ ]:




# In[ ]:




# In[ ]:




# Сколько в среднем внутри групп уходят?

# In[ ]:




# Покажите группу в связке (number_project, hours_level), которые мало работали и уходили больше, чем в среднем по группам?

# In[ ]:




# # Matplotlib

# Импорт

# In[ ]:




# Сделайте на одном графике:
# 
# 1) гистограммку по количеству проектов; 
# 
# 2) точечный график зависимости last_evaluation от satisfaction_level с маркером "+";
# 
# 3) график роста average_montly_hours
# 
# 4) график значений time_spend_company и number_project для первых 20 человек
# 
# Подпишите оси, названия графиков, легенду и промаштабируйте оси, если в этом возникнет необходиомсть, и пусть цвета графиков не повторяются на подграфиках.
# 
# А затем сохраните это все в файл "all_together.png"

# In[ ]:




# In[ ]:



